# SelectionUIOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SelectionUIOptions Methods
SelectionUIOptions Class See Also
---
The SelectionUIOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| ElementSelectsAsPinned | Checks whether the specified element will be treated as pinned for the purposes of selection. |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSelectionUIOptions | Returns the current user's SelectionOptions. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace